app/controllers/videos_controller.rb

INSERT INTO "videos" ("attachment", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["attachment", "2048.jpg"], ["created_at", Thu, 30 Jan 2014 22:34:55 UTC +00:00], ["name", "test0"], ["updated_at", Thu, 30 Jan 2014 22:34:55 UTC +00:00]]
---
  def create
    @video = Video.new()                                                                     #get the attachemnt and create a video object with it

    if @video.save                                                                                   #if it saves then get the urll

SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "videos" SET "extension" = ?, "updated_at" = ? WHERE "videos"."id" = 1  [["extension", "m4v"], ["updated_at", Sat, 01 Feb 2014 21:02:59 UTC +00:00]]
---
  def show
    @video = Video.find(params[:id])
    @video.views += 1

    @video.save

SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", "6"]]
---
  def delete_page

    @video = Video.find(params[:id])

SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "videos" SET "name" = ?, "updated_at" = ? WHERE "videos"."id" = 1  [["name", "Test123"], ["updated_at", Mon, 03 Feb 2014 01:00:50 UTC +00:00]]
---
  def update
    @video = Video.find(params[:id])
    if owner?(@video.user_id)|| not_signed_in_owner?(@video)
      @video.update(video_title)

SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "videos" WHERE "videos"."id" = ?  [["id", 1]]
---
  def destroy
    @video = Video.find(params[:id])
    #first check if the user is logged in and the owner otherwise see if the delete key is valid
    if ((@video.user_id && owner?(@video.user_id)) || (params[:delete_key] && @video.delete_key && @video.delete_key == params[:delete_key]))